<?php

return [

    'created' =>'সফলভাবে তৈরি হয়েছে।',
    'deleted' => 'সফলভাবে মুছে ফেলা হয়েছে।',
    'multi_deleted' => 'নির্বাচিত সফলভাবে মুছে ফেলা হয়েছে।',
    'saved' => 'সফলভাবে সংরক্ষিত.',
    'deleted_failed' => 'আইটেম মোছা হয়নি।',
    'multi_deleted_failed' => 'নির্বাচিত মুছে ফেলা হয়নি।',
    'select_error' => 'অনুগ্রহ করে আইটেম নির্বাচন করুন',
    'invalid' => 'অবৈধ আইটেম',
    'invalid_code' => 'ভুল সঙ্কেত',
    'invalid_link' => 'অবৈধ লিঙ্ক',
    'invalid_data' => 'অবৈধ তথ্য',
    'assigned' => 'সফলভাবে বরাদ্দ করা হয়েছে।',
    'somthing_wrong' => 'কিছু ভুল!',
    'demo_mode' => 'এই ক্রিয়াটি ডেমো মোডে নিষ্ক্রিয় করা হয়েছে',
    'imported' => 'সফলভাবে আমদানি করা হয়েছে।',
    'something_wrong' => 'কিছু ভুল হয়েছে',
    'check_item' => 'দয়া করে নতুন আইটেমটি চেক করুন যা এই মুহূর্তে তৈরি হয়েছে!',
    'paying_item' => 'আপনার আইটেম পরিশোধ করার জন্য লিঙ্ক আছে!',
    'are_you_sure' => 'তুমি কি নিশ্চিত!',

];