<?php

return [

    'pages' =>[
        'created' => 'Страница успешно создана.',
        'saved' => 'Страница успешно сохранена.',
        'deleted' => 'Страница успешно удалена.',
        'multi_deleted' => 'Выбранные страницы успешно удалены.',

        'created_failed' => 'Страница не создана.',
        'saved_failed' => 'Страница не сохранена.',
        'deleted_failed' => 'Страница не была удалена.',
        'multi_deleted_failed' => 'Выбранные страницы не были удалены.',

        'not_found' => 'Страница не найдена.',
        'dont_have_the_permissions' => "У вас нет прав для просмотра этой страницы"
    ],
];