<?php

return [

    'users' =>[
        'created' => 'ব্যবহারকারী সফলভাবে তৈরি করা হয়েছে।',
        'saved' => 'ব্যবহারকারী সফলভাবে সংরক্ষিত হয়েছে।',
        'deleted' => 'ব্যবহারকারীকে সফলভাবে মুছে ফেলা হয়েছে।',
        'permissions_assigned' => 'ভুমিকা এবং অনুমতিগুলি সফলভাবে ব্যবহারকারীকে বরাদ্দ করা হয়েছে৷',
        'deleted_failed' => 'ব্যবহারকারীকে মুছে ফেলা হয়নি।',
        'multi_deleted' => 'নির্বাচিত ব্যবহারকারীদের সফলভাবে মুছে ফেলা হয়েছে।',
        'multi_deleted_failed' => 'নির্বাচিত ব্যবহারকারীদের মুছে ফেলা হয়নি।',
        'deleted_failed_admin' => 'আপনি এই ব্যবহারকারীকে মুছতে পারবেন না।',
        'multi_deleted_failed_admin' => 'আপনি প্রশাসককে মুছতে পারবেন না, চালিয়ে যেতে নির্বাচিত আইটেমগুলি থেকে প্রশাসককে সরান৷',
        'not_found' => 'ব্যবহারকারী খুঁজে পাওয়া যায় না.'
    ]

];