<?php

return [

    'users' =>'ব্যবহারকারী',
    'user_list' => 'ব্যবহারকারীর তালিকা',
    'create_new_user' => 'নতুন ব্যবহারকারী তৈরি করুন',
    'add_user' => 'ব্যবহারকারী যোগ করুন',
    'edit_user' => 'ব্যবহারকারী সম্পাদনা করুন',
    'selected_users' => 'নির্বাচিত ব্যবহারকারী',
    'my_profile' => 'আমার প্রোফাইল',
    'account_settings' => 'অ্যাকাউন্ট সেটিংস',

    'table' => [
        'id' => 'আইডি',
        'user' => 'ব্যবহারকারী',
        'role' => 'ভূমিকা',
        'user_type' => 'ব্যবহারকারীর ধরন',
        'avatar' => 'অবতার',
        'full_name' => 'পুরো নাম',
        'name' => 'নাম',
        'email' => 'ইমেল',
        'password' => 'পাসওয়ার্ড',
    ]

];