<?php

return [

    'posts' => [
        'created' => 'تم إنشاء المشاركة بنجاح.',
        'saved' => 'تم حفظ المشاركة بنجاح.',
        'deleted' => 'تم حذف المشاركة بنجاح.',
        'multi_deleted' => 'تم حذف المشاركات المختارة بنجاح.',

        'created_failed' => 'لم يتم إنشاء المشاركة.',
        'saved_failed' => 'لم يتم حفظ المشاركة.',
        'deleted_failed' => 'لم يتم حذف المشاركة.',
        'multi_deleted_failed' => 'لم يتم حذف المشاركات المختارة.',

        'not_found' => 'لم يتم العثور على المشاركة.',
        'dont_have_the_permissions' => "ليس لديك إذن لعرض هذه الصفحة"
    ],


    'categories' => [
        'created' => 'تم إنشاء الفئة بنجاح.',
        'saved' => 'تم حفظ الفئة بنجاح.',
        'deleted' => 'تم حذف الفئة بنجاح.',
        'multi_deleted' => 'تم حذف الفئات المحددة بنجاح.',

        'created_failed' => 'لم يتم إنشاء الفئة.',
        'saved_failed' => 'لم يتم حفظ الفئة.',
        'deleted_failed' => 'لم يتم حذف الفئة.',
        'multi_deleted_failed' => 'لم يتم حذف الفئات المحددة.',

        'deleted_failed_related' => 'لا يمكنك حذف هذه الفئة لأنها مرتبطة بنماذج أخرى.',
        'multi_deleted_failed_related' => 'لا يمكنك حذف هذه الفئات لأنها مرتبطة بنماذج أخرى.',

        'not_found' => 'الفئة غير موجودة.'
    ],

    'tags' => [
        'created' => 'تم إنشاء العلامة بنجاح.',
        'saved' => 'تم حفظ العلامة بنجاح.',
        'deleted' => 'تم حذف العلامة بنجاح.',
        'multi_deleted' => 'تم حذف العلامات المختارة بنجاح.',

        'created_failed' => 'لم يتم إنشاء العلامة.',
        'saved_failed' => 'لم يتم حفظ العلامة.',
        'deleted_failed' => 'لم يتم حذف العلامة.',
        'multi_deleted_failed' => 'لم يتم حذف العلامات المختارة.',

        'deleted_failed_related' => 'لا يمكنك حذف هذه العلامة لأنها مرتبطة بطرازات أخرى.',
        'multi_deleted_failed_related' => 'لا يمكنك حذف هذه العلامات لأنها مرتبطة بنماذج أخرى.',


        'not_found' => 'لم يتم العثور على العلامة.'
    ],


    'comments' => [
        'created' => 'تم إنشاء التعليق بنجاح.',
        'saved' => 'تم حفظ التعليق بنجاح.',
        'deleted' => 'تم حذف التعليق بنجاح.',
        'multi_deleted' => 'تم حذف التعليقات المختارة بنجاح.',

        'rejected' => 'تم رفض التعليق بنجاح.',
        'multi_rejected' => 'تم رفض التعليقات المختارة بنجاح.',

        'approved' => 'تمت الموافقة على التعليق بنجاح.',
        'multi_approved' => 'تمت الموافقة على التعليقات المختارة بنجاح.',

        'created_failed' => 'لم يتم إنشاء التعليق.',
        'saved_failed' => 'لم يتم حفظ التعليق.',
        'deleted_failed' => 'لم يتم حذف التعليق.',
        'multi_deleted_failed' => 'لم يتم حذف التعليقات المختارة.',

        'rejected_failed' => 'لم يتم رفض التعليق.',
        'multi_rejected_failed' => 'لم يتم رفض التعليقات المختارة.',

        'approved_failed' => 'لم تتم الموافقة على التعليق.',
        'multi_approved_failed' => 'لم تتم الموافقة على التعليقات المختارة.',

        'deleted_failed_related' => 'لا يمكنك حذف هذا التعليق لأنه مرتبط بنماذج أخرى.',
        'multi_deleted_failed_related' => 'لا يمكنك حذف هذه التعليقات لأنها مرتبطة بنماذج أخرى.',


        'not_found' => 'التعليق غير موجود.',
        'not_found_post' => 'لم يتم العثور على المشاركة.',
    ],




];
