<?php

return [

    'languages' =>[
        'created' => 'ভাষা সফলভাবে তৈরি করা হয়েছে।',
        'saved' => 'ভাষা সফলভাবে সংরক্ষিত হয়েছে।',
        'deleted' => 'ভাষা সফলভাবে মুছে ফেলা হয়েছে।',
        'multi_deleted' => 'নির্বাচিত ভাষা সফলভাবে মুছে ফেলা হয়েছে।',

        'created_failed' => 'ভাষা তৈরি হয়নি।',
        'saved_failed' => 'ভাষা সংরক্ষিত হয়নি।',
        'deleted_failed' => 'ভাষা মুছে ফেলা হয়নি।',
        'multi_deleted_failed' => 'নির্বাচিত ভাষাগুলি মুছে ফেলা হয়নি।',

        'default_success' => 'ভাষা সফলভাবে ডিফল্ট সেট করা হয়েছে৷',
        'default_failed' => 'ভাষা ডিফল্ট সেট করা হয়নি।',

        'not_found' => 'ভাষা পাওয়া যায়নি।'
    ],

    'translations' => [
        'saved' => 'অনুবাদ সফলভাবে সংরক্ষিত হয়েছে।',
    ]
];