<?php

return [

    'created' =>'Успешно создано.',
    'deleted' => 'Удален успешно.',
    'multi_deleted' => 'Выбранное успешно удалено.',
    'saved' => 'Успешно сохранено.',
    'deleted_failed' => 'Элемент не был удален.',
    'multi_deleted_failed' => 'Выбранное не удалено.',
    'select_error' => 'Пожалуйста, выберите элементы',
    'invalid' => 'Недопустимый элемент',
    'invalid_code' => 'Неверный код',
    'invalid_link' => 'Неправильная ссылка',
    'invalid_data' => 'Неверные данные',
    'assigned' => 'Назначено успешно.',
    'somthing_wrong' => 'Что-то не так!',
    'demo_mode' => 'Это действие отключено в демонстрационном режиме',
    'imported' => 'импортирован успешно.',
    'something_wrong' => 'Что-то пошло не так',
    'check_item' => 'Пожалуйста, проверьте новый элемент, который только что был создан прямо сейчас!',
    'paying_item' => 'Есть ссылка для оплаты вашего товара!',
    'are_you_sure' => 'Ты уверен!',

];