<?php

return [

    'created' =>"Успешно создано.",
    'deleted' => 'Удален успешно.',
    'multi_deleted' => 'Выбрано успешно удалено.',
    'saved' => 'Успешно сохранено.',
    'deleted_failed' => 'Элемент не был удален.',
    'multi_deleted_failed' => 'Выбрано, но не удалено.',
    'select_error' => 'Пожалуйста, выберите элементы',
    'invalid' => 'Неверный элемент',
    'invalid_link' => 'Неправильная ссылка',
    'invalid_data' => 'Неправильные данные',
    'assigned' => 'Назначено успешно.',
    'somthing_wrong' => 'Что-то не так!',
    'demo_mode' => 'Это действие отключено в демонстрационном режиме',
    'imported' => 'импортирован успешно.',
    'something_wrong' => 'Что-то пошло не так',

];