<?php

return [

    'users' => [
        'created' => 'تم إنشاء المستخدم بنجاح.',
        'saved' => 'تم حفظ المستخدم بنجاح.',
        'deleted' => 'تم حذف المستخدم بنجاح.',
        'permissions_assigned' => 'تم تعيين الأدوار والأذونات للمستخدم بنجاح.',
        'deleted_failed' => 'لم يتم حذف المستخدم.',
        'multi_deleted' => 'تم حذف المستخدمين المختارين بنجاح.',
        'multi_deleted_failed' => 'لم يتم حذف المستخدمين المختارين.',
        'deleted_failed_admin' => 'لا يمكنك حذف هذا المستخدم.',
        'multi_deleted_failed_admin' => 'لا يمكنك حذف المسؤول ، قم بإزالة المسؤول من العناصر المحددة للمتابعة.',
        'not_found' => 'لم يتم العثور على المستخدم.'
    ]

];