<?php

return [

    'pages' =>[
        'created' => 'পৃষ্ঠাটি সফলভাবে তৈরি করা হয়েছে।',
        'saved' => 'পৃষ্ঠা সফলভাবে সংরক্ষিত হয়েছে।',
        'deleted' => 'পৃষ্ঠা সফলভাবে মুছে ফেলা হয়েছে।',
        'multi_deleted' => 'নির্বাচিত পৃষ্ঠা সফলভাবে মুছে ফেলা হয়েছে।',

        'created_failed' => 'পৃষ্ঠা তৈরি করা হয়নি।',
        'saved_failed' => 'পৃষ্ঠাটি সংরক্ষণ করা হয়নি।',
        'deleted_failed' => 'পৃষ্ঠা মুছে ফেলা হয়নি।',
        'multi_deleted_failed' => 'নির্বাচিত পৃষ্ঠাগুলি মুছে ফেলা হয়নি।',

        'not_found' => 'পৃষ্ঠা খুঁজে পাওয়া যায়নি.',
        'dont_have_the_permissions' => "আপনার এই পৃষ্ঠাটি দেখার অনুমতি নেই"
    ],
];