<?php

return [

    'users' =>[
        'created' => 'Пользователь успешно создан.',
        'saved' => 'Пользователь успешно сохранен.',
        'deleted' => 'Пользователь успешно удален.',
        'permissions_assigned' => 'Роли и разрешения успешно назначены пользователю.',
        'deleted_failed' => 'Пользователь не удален.',
        'multi_deleted' => 'Выбранные пользователи успешно удалены.',
        'multi_deleted_failed' => 'Выбранные пользователи не были удалены.',
        'deleted_failed_admin' => 'Вы не можете удалить этого пользователя.',
        'multi_deleted_failed_admin' => 'Вы не можете удалить администратора. Удалите администратора из выбранных элементов, чтобы продолжить.',
        'not_found' => 'Пользователь не найден.'
    ]

];