<?php

return [

    'users' =>'Пользователи',
    'user_list' => 'Список пользователей',
    'create_new_user' => 'Создать нового пользователя',
    'add_user' => 'Добавить пользователя',
    'edit_user' => 'Редактировать пользователя',
    'selected_users' => 'избранные пользователи',
    'my_profile' => 'Мой профиль',
    'account_settings' => 'Настройки учетной записи',

    'table' => [
        'id' => 'Я БЫ',
        'user' => 'Пользователь',
        'role' => 'Роль',
        'user_type' => 'Тип пользователя',
        'avatar' => 'Аватар',
        'full_name' => 'ФИО',
        'name' => 'Имя',
        'email' => 'Эл. адрес',
        'password' => 'Пароль',
    ]

];