<?php

return [

    'posts' =>[
        'created' =>'পোস্ট সফলভাবে তৈরি করা হয়েছে',
        'saved' => 'পোস্ট সফলভাবে সংরক্ষিত হয়েছে।',
        'deleted' => 'পোস্ট সফলভাবে মুছে ফেলা হয়েছে।',
        'multi_deleted' => 'নির্বাচিত পোস্ট সফলভাবে মুছে ফেলা হয়েছে।',

        'created_failed' => 'পোস্ট তৈরি করা হয়নি।',
        'saved_failed' => 'পোস্ট সংরক্ষিত হয়নি।',
        'deleted_failed' => 'পোস্ট ডিলিট করা হয়নি।',
        'multi_deleted_failed' => 'নির্বাচিত পোস্ট মুছে ফেলা হয়নি।',

        'not_found' => 'পোস্ট পাওয়া যায়নি।',
        'dont_have_the_permissions' => "আপনার এই পৃষ্ঠাটি দেখার অনুমতি নেই"
    ],


    'categories' => [
        'created' => 'বিভাগ সফলভাবে তৈরি করা হয়েছে।',
        'saved' => 'বিভাগ সফলভাবে সংরক্ষিত হয়েছে।',
        'deleted' => 'বিভাগ সফলভাবে মুছে ফেলা হয়েছে।',
        'multi_deleted' => 'নির্বাচিত বিভাগ সফলভাবে মুছে ফেলা হয়েছে।',

        'created_failed' => 'ক্যাটাগরি তৈরি করা হয়নি।',
        'saved_failed' => 'বিভাগ সংরক্ষণ করা হয়নি।',
        'deleted_failed' => 'বিভাগ মুছে ফেলা হয়নি।',
        'multi_deleted_failed' => 'নির্বাচিত বিভাগগুলি মুছে ফেলা হয়নি।',

        'deleted_failed_related' => 'আপনি এই বিভাগটি মুছে ফেলতে পারবেন না কারণ এটি অন্যান্য মডেলের সাথে সম্পর্কিত৷',
        'multi_deleted_failed_related' => 'আপনি এই বিভাগগুলি মুছতে পারবেন না কারণ এটি অন্যান্য মডেলের সাথে সম্পর্কিত৷',

        'not_found' => 'ক্যাটাগরি পাওয়া যায়নি।'
    ],

    'tags' => [
        'created' => 'ট্যাগ সফলভাবে তৈরি করা হয়েছে।',
        'saved' => 'ট্যাগ সফলভাবে সংরক্ষিত হয়েছে।',
        'deleted' => 'ট্যাগ সফলভাবে মুছে ফেলা হয়েছে।',
        'multi_deleted' => 'নির্বাচিত ট্যাগ সফলভাবে মুছে ফেলা হয়েছে।',

        'created_failed' => 'ট্যাগ তৈরি করা হয়নি।',
        'saved_failed' => 'ট্যাগ সংরক্ষণ করা হয়নি।',
        'deleted_failed' => 'ট্যাগ মুছে ফেলা হয়নি।',
        'multi_deleted_failed' => 'নির্বাচিত ট্যাগ মোছা হয়নি।',

        'deleted_failed_related' => 'আপনি এই ট্যাগটি মুছতে পারবেন না কারণ এটি অন্যান্য মডেলের সাথে সম্পর্কিত৷',
        'multi_deleted_failed_related' => 'আপনি এই ট্যাগগুলি মুছতে পারবেন না কারণ এটি অন্যান্য মডেলের সাথে সম্পর্কিত৷',


        'not_found' => 'ট্যাগ পাওয়া যায়নি।'
    ],


    'comments' => [
        'created' => 'মন্তব্য সফলভাবে তৈরি করা হয়েছে।',
        'saved' => 'মন্তব্য সফলভাবে সংরক্ষিত হয়েছে।',
        'deleted' => 'মন্তব্য সফলভাবে মুছে ফেলা হয়েছে।',
        'multi_deleted' => 'নির্বাচিত মন্তব্য সফলভাবে মুছে ফেলা হয়েছে।',

        'rejected' => 'মন্তব্য সফলভাবে প্রত্যাখ্যান করা হয়েছে।',
        'multi_rejected' => 'নির্বাচিত মন্তব্য সফলভাবে প্রত্যাখ্যান করা হয়েছে।',

        'approved' => 'মন্তব্য সফলভাবে অনুমোদিত হয়েছে।',
        'multi_approved' => 'নির্বাচিত মন্তব্য সফলভাবে অনুমোদিত হয়েছে।',

        'created_failed' => 'মন্তব্য তৈরি করা হয়নি।',
        'saved_failed' => 'মন্তব্য সংরক্ষণ করা হয়নি।',
        'deleted_failed' => 'মন্তব্য মুছে ফেলা হয়নি।',
        'multi_deleted_failed' => 'নির্বাচিত মন্তব্য মুছে ফেলা হয়নি।',

        'rejected_failed' => 'মন্তব্য প্রত্যাখ্যান করা হয়নি।',
        'multi_rejected_failed' => 'নির্বাচিত মন্তব্য প্রত্যাখ্যান করা হয়নি।',

        'approved_failed' => 'মন্তব্য অনুমোদিত হয়নি।',
        'multi_approved_failed' => 'নির্বাচিত মন্তব্য অনুমোদন করা হয়নি।',

        'deleted_failed_related' => 'আপনি এই মন্তব্যটি মুছতে পারবেন না কারণ এটি অন্যান্য মডেলের সাথে সম্পর্কিত৷',
        'multi_deleted_failed_related' => 'আপনি এই মন্তব্যগুলি মুছতে পারবেন না কারণ এটি অন্যান্য মডেলের সাথে সম্পর্কিত৷',


        'not_found' => 'মন্তব্য পাওয়া যায়নি।',
        'not_found_post' => 'পোস্ট পাওয়া যায়নি।',
    ],




];